# Задача 2.Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. 
# Дано a, b, c - стороны предполагаемого треугольника. 
# Требуется сравнить длину каждого отрезка-стороны с суммой двух других. 
# Если хотя бы в одном случае отрезок окажется больше суммы двух других, 
# то треугольника с такими сторонами не существует. 
# Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.

a = int(input("Введите первую длину треугольника: "))
b = int(input("Введите вторую длину треугольника: "))
c = int(input("Введите третью длину треуголькинка: "))

if a > b + c or b > c + a or c > a + b:
    print("Треугольника с такими сторонами не сущестует.")
else:
    if a == b and b == c:
        print("Треугольник равносторонний.")
    elif a != b and a != c and b != c:
        print("Треугольник разносторонний.")
    else:
        print("Треугольник равнобедренный.")
